artillery/test.yaml
config:
  target: "https://localhost:3001"
  http:
    timeout: 30
  tls:
      rejectUnauthorized: false
  phases:
    - duration: 30
      arrivalRate: 1
  environments:
    local-dev:
      target: 'http://localhost:3001'
      phases:
      - arrivalRate: 30
        duration: 60
  # plugins:
  #   metrics-by-endpoint: {}
scenarios:
  # We define one scenario:
  - name: "Search product details"
    flow:
      - get:
          url: "/products/{{ product_id }}"
      - get:
          url: "/products/{{ product_id }}/styles"
      - get:
          url: "/products/{{ product_id }}/related"